app/Http/Controllers/AjaxController.php

select * from `customers` where `phoneno` LIKE '%04%' and `customers`.`deleted_at` is null limit 10
select * from `vehicles` where `vehicles`.`customer_id` in (2, 3, 5, 6, 7, 8, 9, 10, 11, 12) and `vehicles`.`deleted_at` is null
---
    public function getcustomerwithvehicle(Request $request)
    {
        // dd($request->all());
        $customers = Customer::with('vehicles')->where('phoneno', 'LIKE', '%'.$request->input('term').'%')->take(10)->get();

select * from `customers` where `customers`.`id` in (64, 65)
select * from `vehicles` where `rego` LIKE '%fo%' and `vehicles`.`deleted_at` is null limit 10
---
    public function getvehiclewithcustomer(Request $request)
    {
        // dd($request->all());
        $vehicle = Vehicle::with('customer')->where('rego', 'LIKE', '%'.$request->input('term').'%')->take(10)->get();

select * from `descriptions` where `descriptions`.`job_id` in (70) and `descriptions`.`deleted_at` is null
---
    public function getjob(Request $request)
    {
        $job = Job::with('descriptions')->where('name', 'LIKE', '%'.$request->input('term').'%')->take(10)->get();

select * from `quotes` where `quotes`.`id` = '91' and `quotes`.`deleted_at` is null limit 1
update `quotes` set `type` = 'I', `quotes`.`updated_at` = '2024-05-11 02:05:54' where `id` = 91
---
    public function updatetype(Request $request)
    {
        //$quote = Quote::where('quote_number', $request->input('quote_id'))->first();
        $quote = Quote::findOrFail($request->input('id'));
        //dump($quote);
        if($quote->type == 'Q')
            $quote->type = 'I';
        else
            $quote->type = 'Q';

        $quote->save();

select * from `quotes` where `quotes`.`id` = 91 and `quotes`.`deleted_at` is null limit 1
---
    public function generateinvoice(int $invoice_id)
    {
        $invoice = Quote::findOrFail($invoice_id);

select * from `quotes` where `quotes`.`id` = '90' and `quotes`.`deleted_at` is null limit 1
select * from `customers` where `customers`.`id` = 42 and `customers`.`deleted_at` is null limit 1
---
    public function sendemail(SendEmailRequest $request)
    {
        $details = $request->validated();
        //dd($details);
        $invoice = Quote::findOrFail($details['id']);
        //dd($invoice);
        $customer = Customer::findOrFail($invoice->customer_id);