app/Http/Controllers/CustomerController.php

    public function index(Request $request)
    {
        $customers = Customer::when($request->has('archive'), function($query){
            $query->onlyTrashed();
        })->orderBy('created_at','desc')->get();
---
select * from `customers` where `customers`.`deleted_at` is null order by `created_at` desc

    public function store(StoreCustomerRequest $request)
    {
        //dd($request->all());
        $customer = Customer::create($request->validated());
---
insert into `customers` (`title`, `name`, `phoneno`, `altphoneno`, `abn`, `address`, `suburb`, `state`, `postcode`, `email`, `company_name`, `warn`, `updated_at`, `created_at`) values ('Mr.', 'Ricky Milazzo', '0458553813', '', '', '', 'Craigieburne', 'VIC', '3064', 'ricky.milazzo@icloud.com', '', '', '2024-05-11 01:59:15', '2024-05-11 01:59:15')