app/Http/Controllers/InvoiceController.php

select * from `quotes` where `type` = 'I' and `quotes`.`deleted_at` is null order by `created_at` desc
---
    public function index()
    {
        $invoices = Quote::with('jobs')->where('type', 'I')->orderBy('created_at','desc')->get();

select * from `quotes` where `quotes`.`id` = '90' and `quotes`.`deleted_at` is null limit 1
---
    public function show($id)
    {
        $invoice = Quote::findOrFail($id);