app/Http/Controllers/QuoteController.php

    public function index()
    {
        $quotes = Quote::with('jobs')->where('type', 'Q')->orderBy('created_at','desc')->get(); //->get()->sortDesc();
---
select * from `quotes` where `type` = 'Q' and `quotes`.`deleted_at` is null order by `created_at` desc

    public function create($customerid = null, $customername = null, $phoneno = null, $vehicleid = null, $rego = null, $make = null, $model = null, $transmission = null, $vin_no = null, $year = null)
    {
        $from = date('Y-m-d', strtotime('first day of january this year'));
        $to = date('Y-m-d');

        $latest = Quote::whereBetween('quote_date', [$from, $to])->withTrashed()->max('quote_number');
---
select max(`quote_number`) as aggregate from `quotes` where `quote_date` between '2024-01-01' and '2024-05-11'

    public function store(StoreQuoteRequest $request)
    {
        // dump($request->toArray());
        $quote = $request->validated();
        $quote['quote_date'] = Carbon::createFromFormat('d-m-Y', $quote['quote_date'])->format('Y-m-d');
        $quote['quote_duedate'] = Carbon::createFromFormat('d-m-Y', $quote['quote_duedate'])->format('Y-m-d');
        $quote['nextservicedate'] = Carbon::createFromFormat('d-m-Y', $quote['nextservicedate'])->format('Y-m-d');

        if($quote['quoteyear'] != date('Y', strtotime($quote['quote_date'])))
        {
            //return redirect()->route('quotes.create')->with('error', 'Quote year and quote date do not match');
            return response()->json(['status' => 400, 'error' => 'Quote year and quote date do not match']);
        }

        //Check if this quote number is already saved
        $startOfYear = date('Y-m-d', strtotime('first day of january this year'));
        $endOfYear   = date('Y-m-d', strtotime('last day of december this year'));

        $exist = Quote::whereBetween(DB::raw('DATE(quote_date)'), [$startOfYear, $endOfYear])->where(
        [
            ['type', '=', 'Q'],
            ['quote_number', '=', $quote['quote_number']]
        ])->get();
---
select * from `quotes` where (`type` = 'Q' and `quote_number` = '80') and `quotes`.`deleted_at` is null

            ];
        }
        // dump($jobs);
        $saved_quote = Quote::create($quote);
---
insert into `quotes` (`quote_number`, `quote_date`, `quote_duedate`, `taxable`, `customer_id`, `vehicle_id`, `odometer`, `nextservicekms`, `nextservicedate`, `remarks`, `jobdetails`, `notes`, `tire_fl`, `tire_fr`, `tire_rl`, `tire_rr`, `frontbrakepads`, `rearbrakepads`, `amtdue`, `updated_at`, `created_at`) values ('80', '2024-05-11', '2024-05-11', '1', '67', '71', '197048', '', '2024-05-11', 'Front wipers, Transmission fluid leaking, Front control arm bushes, Frot left headlight crack, headlight polish, Front brake pads paint contamination including dust boot paint contamination and rear brake caliper dust boot paint contamination', '', '', '6', '6', '6', '6', '6', '6', '0.00', '2024-05-11 02:05:51', '2024-05-11 02:05:51')
insert into `job_quote` (`created_at`, `job_id`, `quantity`, `quote_id`, `rate`, `updated_at`) values ('2024-05-11 02:05:51', 70, '1.00', 91, '165.00', '2024-05-11 02:05:51')

    public function update(UpdateQuoteRequest $request, Quote $quote)
    {
        $quote_details = $request->validated();

        $quote_details['quote_date'] = Carbon::createFromFormat('d-m-Y', $quote_details['quote_date'])->format('Y-m-d');
        $quote_details['quote_duedate'] = Carbon::createFromFormat('d-m-Y', $quote_details['quote_duedate'])->format('Y-m-d');
        $quote_details['nextservicedate'] = Carbon::createFromFormat('d-m-Y', $quote_details['nextservicedate'])->format('Y-m-d');
        // dd($quote_details);

        $jobs = [];
        foreach ($quote_details['job_id'] as $index => $jobid) {
            $jobs[$jobid] = [
                'jobtype'   => $quote_details['jobtype'][$index],
                'quantity'  => $quote_details['quantity'][$index],
                'rate'      => $quote_details['price'][$index],
            ];
        }
        // dump($quote_details);
        // dd($jobs);

        $quote->update($quote_details);
---
update `quotes` set `customer_id` = '64', `vehicle_id` = '66', `amtdue` = '0.00', `quotes`.`updated_at` = '2024-05-10 12:57:21' where `id` = 85
update `job_quote` set `quantity` = '1.00', `rate` = '126.50', `updated_at` = '2024-05-10 12:57:05' where `job_quote`.`quote_id` = 85 and `job_id` in (128)