app/Http/Controllers/VehicleController.php

insert into `vehicles` (`customer_id`, `rego`, `make`, `model`, `colour`, `vin_no`, `transmission`, `year`, `updated_at`, `created_at`) values ('67', 'UIB488', 'Mazda', 'Mazda 3', 'Grey', 'JM0BK103200305478', 'A', '2006', '2024-05-11 01:59:54', '2024-05-11 01:59:54')
---
    public function store(StoreVehicleRequest $request)
    {
        // $customer->vehicles()->create($request->validated());
        $vehicle = Vehicle::create($request->validated());